## Staging: performance-test
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 4 to add, 1 to change, 6 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.perf_test_secretsmanager will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "perf_test_secretsmanager"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL",
              + "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_domain-WSUpwW",
              + "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_email-sWnA9Z",
              + (known after apply),
            ]
        }
    }

  # data.template_file.perf_test_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "perf_test_container_definition"  {
      ~ id       = "2436a46f55941f120fdb214bb07c0792555878d823d176e5e1d8d7c0c88949b3" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "PERF_TEST_AWS_S3_BUCKET"
                          - value = "notify-performance-test-results-staging"
                        },
                      - {
                          - name  = "PERF_TEST_CSV_DIRECTORY_PATH"
                          - value = "/tmp/notify_performance_test"
                        },
                      - {
                          - name  = "PERF_TEST_SMS_TEMPLATE_ID"
                          - value = "d5fea9f3-f69d-481e-9186-b7f4eaa5cf63"
                        },
                      - {
                          - name  = "PERF_TEST_BULK_EMAIL_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_WITH_LINK_TEMPLATE_ID"
                          - value = "9fb324a5-821d-4b54-9d52-d9ba1fa8373a"
                        },
                    ]
                  - essential        = true
                  - image            = "239043911459.dkr.ecr.ca-central-1.amazonaws.com/notify/performance-test"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "performance_test_cluster"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "performance_test_cluster-task"
                        }
                    }
                  - name             = "performance-tests-container"
                  - secrets          = [
                      - {
                          - name      = "PERF_TEST_PHONE_NUMBER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_phone_number-DWkOGY"
                        },
                      - {
                          - name      = "PERF_TEST_EMAIL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_email-sWnA9Z"
                        },
                      - {
                          - name      = "PERF_TEST_DOMAIN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_domain-WSUpwW"
                        },
                      - {
                          - name      = "PERF_TEST_AUTH_HEADER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 98304
                          - name      = "nofile"
                          - softLimit = 98304
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply)
      ~ vars     = {
          ~ "PERF_TEST_PHONE_NUMBER_ARN"                  = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_phone_number-DWkOGY" -> (known after apply)
            # (14 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_cloudwatch_event_rule.performance-testing will be destroyed
  - resource "aws_cloudwatch_event_rule" "performance-testing" {
      - arn                 = "arn:aws:events:ca-central-1:239043911459:rule/performance-testing" -> null
      - description         = "performance-testing event rule" -> null
      - event_bus_name      = "default" -> null
      - id                  = "performance-testing" -> null
      - is_enabled          = true -> null
      - name                = "performance-testing" -> null
      - schedule_expression = "cron(0 0 * * ? *)" -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
    }

  # aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "perf_test_event_rule-terraform-20211129205416437200000001"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
            tags                    = {}
          ~ task_definition_arn     = "arn:aws:ecs:ca-central-1:239043911459:task-definition/performance_test_cluster:1" -> (known after apply)
            # (6 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_ecs_task_definition.perf_test_task must be replaced
-/+ resource "aws_ecs_task_definition" "perf_test_task" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:239043911459:task-definition/performance_test_cluster:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "PERF_TEST_AWS_S3_BUCKET"
                          - value = "notify-performance-test-results-staging"
                        },
                      - {
                          - name  = "PERF_TEST_BULK_EMAIL_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_CSV_DIRECTORY_PATH"
                          - value = "/tmp/notify_performance_test"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_WITH_LINK_TEMPLATE_ID"
                          - value = "9fb324a5-821d-4b54-9d52-d9ba1fa8373a"
                        },
                      - {
                          - name  = "PERF_TEST_SMS_TEMPLATE_ID"
                          - value = "d5fea9f3-f69d-481e-9186-b7f4eaa5cf63"
                        },
                    ]
                  - essential        = true
                  - image            = "239043911459.dkr.ecr.ca-central-1.amazonaws.com/notify/performance-test"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "performance_test_cluster"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "performance_test_cluster-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "performance-tests-container"
                  - portMappings     = []
                  - secrets          = [
                      - {
                          - name      = "PERF_TEST_PHONE_NUMBER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_phone_number-DWkOGY"
                        },
                      - {
                          - name      = "PERF_TEST_EMAIL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_email-sWnA9Z"
                        },
                      - {
                          - name      = "PERF_TEST_DOMAIN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_domain-WSUpwW"
                        },
                      - {
                          - name      = "PERF_TEST_AUTH_HEADER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 98304
                          - name      = "nofile"
                          - softLimit = 98304
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "performance_test_cluster" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCentre" = "notification-canada-ca-staging"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.perf_test_ecs_task_get_secret_value will be destroyed
  - resource "aws_iam_policy" "perf_test_ecs_task_get_secret_value" {
      - arn       = "arn:aws:iam::239043911459:policy/PerfTestEcsTaskGetSecretValue" -> null
      - id        = "arn:aws:iam::239043911459:policy/PerfTestEcsTaskGetSecretValue" -> null
      - name      = "PerfTestEcsTaskGetSecretValue" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_phone_number-DWkOGY",
                          - "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_email-sWnA9Z",
                          - "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_domain-WSUpwW",
                          - "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPATPKBAT4RXKJVRYAOS" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # aws_iam_policy.perf_test_secretsmanager will be created
  + resource "aws_iam_policy" "perf_test_secretsmanager" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "PerfTestEcsTaskGetSecretValue"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.perf_test_ecs_task_get_secret_value_policy_attach will be destroyed
  - resource "aws_iam_role_policy_attachment" "perf_test_ecs_task_get_secret_value_policy_attach" {
      - id         = "performance_test_cluster-ecs-task-20211129182102652200000001" -> null
      - policy_arn = "arn:aws:iam::239043911459:policy/PerfTestEcsTaskGetSecretValue" -> null
      - role       = "performance_test_cluster-ecs-task" -> null
    }

  # aws_iam_role_policy_attachment.perf_test_secretsmanager will be created
  + resource "aws_iam_role_policy_attachment" "perf_test_secretsmanager" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "container_execution_role"
    }

  # aws_lambda_function.performance-test will be destroyed
  - resource "aws_lambda_function" "performance-test" {
      - architectures                  = [] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:239043911459:function:performance-test" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - function_name                  = "performance-test" -> null
      - handler                        = "" -> null
      - id                             = "performance-test" -> null
      - image_uri                      = "239043911459.dkr.ecr.ca-central-1.amazonaws.com/notify/performance-test:latest" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:performance-test/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2021-11-29T21:36:04.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 1024 -> null
      - package_type                   = "Image" -> null
      - publish                        = true -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:performance-test:4" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::239043911459:role/performance-test-iam-role" -> null
      - runtime                        = "" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "721bdb805e49fc465163fcc3818218156aa2dd0d4402d9b39736b9152c87dda9" -> null
      - source_code_size               = 0 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 60 -> null
      - version                        = "4" -> null

      - environment {
          - variables = {
              - "PERF_TEST_AUTH_HEADER"                       = (sensitive)
              - "PERF_TEST_AWS_S3_BUCKET"                     = "notify-performance-test-results-staging"
              - "PERF_TEST_BULK_EMAIL_TEMPLATE_ID"            = "fa759679-30f2-4666-94e2-bd4921329c46"
              - "PERF_TEST_CSV_DIRECTORY_PATH"                = "/tmp/notify_performance_test"
              - "PERF_TEST_DOMAIN"                            = (sensitive)
              - "PERF_TEST_EMAIL"                             = (sensitive)
              - "PERF_TEST_EMAIL_TEMPLATE_ID"                 = "fa759679-30f2-4666-94e2-bd4921329c46"
              - "PERF_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID" = "fa759679-30f2-4666-94e2-bd4921329c46"
              - "PERF_TEST_EMAIL_WITH_LINK_TEMPLATE_ID"       = "9fb324a5-821d-4b54-9d52-d9ba1fa8373a"
              - "PERF_TEST_PHONE_NUMBER"                      = (sensitive)
              - "PERF_TEST_SMS_TEMPLATE_ID"                   = "d5fea9f3-f69d-481e-9186-b7f4eaa5cf63"
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_secretsmanager_secret_version.perf_test_phone_number must be replaced
-/+ resource "aws_secretsmanager_secret_version" "perf_test_phone_number" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_phone_number-DWkOGY" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_phone_number-DWkOGY|05C59C8A-2E7F-4E02-8472-621242336EB8" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value)
      ~ version_id     = "05C59C8A-2E7F-4E02-8472-621242336EB8" -> (known after apply)
      ~ version_stages = [
          - "AWSPREVIOUS",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 1 to change, 6 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>